Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70Q20.atdf
        <register caption="Host Global Interrupt Enable Register" name="USBHS_HSTIER" offset="0x0418" rw="W" size="4" atomic-op="set:USBHS_HSTIMR">
          <bitfield caption="Device Connection Interrupt Enable" mask="0x00000001" name="DCONNIES"/>
          <bitfield caption="Device Disconnection Interrupt Enable" mask="0x00000002" name="DDISCIES"/>
          <bitfield caption="USB Reset Sent Interrupt Enable" mask="0x00000004" name="RSTIES"/>
          <bitfield caption="Downstream Resume Sent Interrupt Enable" mask="0x00000008" name="RSMEDIES"/>
          <bitfield caption="Upstream Resume Received Interrupt Enable" mask="0x00000010" name="RXRSMIES"/>
          <bitfield caption="Host Start of Frame Interrupt Enable" mask="0x00000020" name="HSOFIES"/>
          <bitfield caption="Host Wake-Up Interrupt Enable" mask="0x00000040" name="HWUPIES"/>
          <bitfield caption="Pipe 0 Interrupt Enable" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt Enable" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt Enable" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt Enable" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt Enable" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="Pipe 5 Interrupt Enable" mask="0x00002000" name="PEP_5"/>
          <bitfield caption="Pipe 6 Interrupt Enable" mask="0x00004000" name="PEP_6"/>
          <bitfield caption="Pipe 7 Interrupt Enable" mask="0x00008000" name="PEP_7"/>
          <bitfield caption="Pipe 8 Interrupt Enable" mask="0x00010000" name="PEP_8"/>
          <bitfield caption="Pipe 9 Interrupt Enable" mask="0x00020000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Enable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Enable" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Enable" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Host Pipe Register" name="USBHS_HSTPIP" offset="0x0041C" rw="RW" size="4">
          <bitfield caption="Pipe 0 Enable" mask="0x00000001" name="PEN0"/>
          <bitfield caption="Pipe 1 Enable" mask="0x00000002" name="PEN1"/>
          <bitfield caption="Pipe 2 Enable" mask="0x00000004" name="PEN2"/>
          <bitfield caption="Pipe 3 Enable" mask="0x00000008" name="PEN3"/>
          <bitfield caption="Pipe 4 Enable" mask="0x00000010" name="PEN4"/>
          <bitfield caption="Pipe 5 Enable" mask="0x00000020" name="PEN5"/>
          <bitfield caption="Pipe 6 Enable" mask="0x00000040" name="PEN6"/>
          <bitfield caption="Pipe 7 Enable" mask="0x00000080" name="PEN7"/>
          <bitfield caption="Pipe 8 Enable" mask="0x00000100" name="PEN8"/>
          <bitfield caption="Pipe 0 Reset" mask="0x00010000" name="PRST0"/>
          <bitfield caption="Pipe 1 Reset" mask="0x00020000" name="PRST1"/>
          <bitfield caption="Pipe 2 Reset" mask="0x00040000" name="PRST2"/>
          <bitfield caption="Pipe 3 Reset" mask="0x00080000" name="PRST3"/>
          <bitfield caption="Pipe 4 Reset" mask="0x00100000" name="PRST4"/>
          <bitfield caption="Pipe 5 Reset" mask="0x00200000" name="PRST5"/>
          <bitfield caption="Pipe 6 Reset" mask="0x00400000" name="PRST6"/>
          <bitfield caption="Pipe 7 Reset" mask="0x00800000" name="PRST7"/>
          <bitfield caption="Pipe 8 Reset" mask="0x01000000" name="PRST8"/>
        </register>
        <register caption="Host Frame Number Register" name="USBHS_HSTFNUM" offset="0x0420" rw="RW" size="4">
          <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Length" mask="0x00FF0000" name="FLENHIGH"/>
        </register>
        <register caption="Host Address 1 Register" name="USBHS_HSTADDR1" offset="0x0424" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP0"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP1"/>
          <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP2"/>
          <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP3"/>
        </register>
        <register caption="Host Address 2 Register" name="USBHS_HSTADDR2" offset="0x0428" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP4"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP5"/>
          <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP6"/>
          <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP7"/>
        </register>
        <register caption="Host Address 3 Register" name="USBHS_HSTADDR3" offset="0x042C" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP8"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP9"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 0" name="USBHS_HSTPIPCFG" offset="0x500" rw="RW" size="4" count="10">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 0" name="USBHS_HSTPIPISR" offset="0x530" rw="R" size="4" count="10">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
