Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70Q20.atdf
        <register caption="Global Interrupt Disable Register" name="XDMAC_GID" offset="0x10" rw="W" size="4" atomic-op="clear:XDMAC_GIM">
          <bitfield caption="XDMAC Channel 0 Interrupt Disable Bit" mask="0x00000001" name="ID0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Disable Bit" mask="0x00000002" name="ID1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Disable Bit" mask="0x00000004" name="ID2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Disable Bit" mask="0x00000008" name="ID3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Disable Bit" mask="0x00000010" name="ID4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Disable Bit" mask="0x00000020" name="ID5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Disable Bit" mask="0x00000040" name="ID6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Disable Bit" mask="0x00000080" name="ID7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Disable Bit" mask="0x00000100" name="ID8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Disable Bit" mask="0x00000200" name="ID9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Disable Bit" mask="0x00000400" name="ID10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Disable Bit" mask="0x00000800" name="ID11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Disable Bit" mask="0x00001000" name="ID12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Disable Bit" mask="0x00002000" name="ID13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Disable Bit" mask="0x00004000" name="ID14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Disable Bit" mask="0x00008000" name="ID15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Disable Bit" mask="0x00010000" name="ID16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Disable Bit" mask="0x00020000" name="ID17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Disable Bit" mask="0x00040000" name="ID18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Disable Bit" mask="0x00080000" name="ID19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Disable Bit" mask="0x00100000" name="ID20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Disable Bit" mask="0x00200000" name="ID21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Disable Bit" mask="0x00400000" name="ID22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Disable Bit" mask="0x00800000" name="ID23"/>
        </register>
        <register caption="Global Interrupt Mask Register" name="XDMAC_GIM" offset="0x14" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Interrupt Mask Bit" mask="0x00000001" name="IM0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Mask Bit" mask="0x00000002" name="IM1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Mask Bit" mask="0x00000004" name="IM2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Mask Bit" mask="0x00000008" name="IM3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Mask Bit" mask="0x00000010" name="IM4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Mask Bit" mask="0x00000020" name="IM5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Mask Bit" mask="0x00000040" name="IM6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Mask Bit" mask="0x00000080" name="IM7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Mask Bit" mask="0x00000100" name="IM8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Mask Bit" mask="0x00000200" name="IM9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Mask Bit" mask="0x00000400" name="IM10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Mask Bit" mask="0x00000800" name="IM11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Mask Bit" mask="0x00001000" name="IM12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Mask Bit" mask="0x00002000" name="IM13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Mask Bit" mask="0x00004000" name="IM14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Mask Bit" mask="0x00008000" name="IM15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Mask Bit" mask="0x00010000" name="IM16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Mask Bit" mask="0x00020000" name="IM17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Mask Bit" mask="0x00040000" name="IM18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Mask Bit" mask="0x00080000" name="IM19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Mask Bit" mask="0x00100000" name="IM20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Mask Bit" mask="0x00200000" name="IM21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Mask Bit" mask="0x00400000" name="IM22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Mask Bit" mask="0x00800000" name="IM23"/>
        </register>
        <register caption="Global Interrupt Status Register" name="XDMAC_GIS" offset="0x18" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Interrupt Status Bit" mask="0x00000001" name="IS0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Status Bit" mask="0x00000002" name="IS1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Status Bit" mask="0x00000004" name="IS2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Status Bit" mask="0x00000008" name="IS3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Status Bit" mask="0x00000010" name="IS4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Status Bit" mask="0x00000020" name="IS5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Status Bit" mask="0x00000040" name="IS6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Status Bit" mask="0x00000080" name="IS7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Status Bit" mask="0x00000100" name="IS8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Status Bit" mask="0x00000200" name="IS9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Status Bit" mask="0x00000400" name="IS10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Status Bit" mask="0x00000800" name="IS11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Status Bit" mask="0x00001000" name="IS12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Status Bit" mask="0x00002000" name="IS13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Status Bit" mask="0x00004000" name="IS14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Status Bit" mask="0x00008000" name="IS15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Status Bit" mask="0x00010000" name="IS16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Status Bit" mask="0x00020000" name="IS17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Status Bit" mask="0x00040000" name="IS18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Status Bit" mask="0x00080000" name="IS19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Status Bit" mask="0x00100000" name="IS20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Status Bit" mask="0x00200000" name="IS21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Status Bit" mask="0x00400000" name="IS22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Status Bit" mask="0x00800000" name="IS23"/>
        </register>
        <register caption="Global Channel Enable Register" name="XDMAC_GE" offset="0x1C" rw="W" size="4" atomic-op="set:XDMAC_GS">
          <bitfield caption="XDMAC Channel 0 Enable Bit" mask="0x00000001" name="EN0"/>
          <bitfield caption="XDMAC Channel 1 Enable Bit" mask="0x00000002" name="EN1"/>
          <bitfield caption="XDMAC Channel 2 Enable Bit" mask="0x00000004" name="EN2"/>
          <bitfield caption="XDMAC Channel 3 Enable Bit" mask="0x00000008" name="EN3"/>
          <bitfield caption="XDMAC Channel 4 Enable Bit" mask="0x00000010" name="EN4"/>
          <bitfield caption="XDMAC Channel 5 Enable Bit" mask="0x00000020" name="EN5"/>
          <bitfield caption="XDMAC Channel 6 Enable Bit" mask="0x00000040" name="EN6"/>
          <bitfield caption="XDMAC Channel 7 Enable Bit" mask="0x00000080" name="EN7"/>
          <bitfield caption="XDMAC Channel 8 Enable Bit" mask="0x00000100" name="EN8"/>
          <bitfield caption="XDMAC Channel 9 Enable Bit" mask="0x00000200" name="EN9"/>
          <bitfield caption="XDMAC Channel 10 Enable Bit" mask="0x00000400" name="EN10"/>
          <bitfield caption="XDMAC Channel 11 Enable Bit" mask="0x00000800" name="EN11"/>
          <bitfield caption="XDMAC Channel 12 Enable Bit" mask="0x00001000" name="EN12"/>
          <bitfield caption="XDMAC Channel 13 Enable Bit" mask="0x00002000" name="EN13"/>
          <bitfield caption="XDMAC Channel 14 Enable Bit" mask="0x00004000" name="EN14"/>
          <bitfield caption="XDMAC Channel 15 Enable Bit" mask="0x00008000" name="EN15"/>
          <bitfield caption="XDMAC Channel 16 Enable Bit" mask="0x00010000" name="EN16"/>
          <bitfield caption="XDMAC Channel 17 Enable Bit" mask="0x00020000" name="EN17"/>
          <bitfield caption="XDMAC Channel 18 Enable Bit" mask="0x00040000" name="EN18"/>
          <bitfield caption="XDMAC Channel 19 Enable Bit" mask="0x00080000" name="EN19"/>
          <bitfield caption="XDMAC Channel 20 Enable Bit" mask="0x00100000" name="EN20"/>
          <bitfield caption="XDMAC Channel 21 Enable Bit" mask="0x00200000" name="EN21"/>
          <bitfield caption="XDMAC Channel 22 Enable Bit" mask="0x00400000" name="EN22"/>
          <bitfield caption="XDMAC Channel 23 Enable Bit" mask="0x00800000" name="EN23"/>
        </register>
        <register caption="Global Channel Disable Register" name="XDMAC_GD" offset="0x20" rw="W" size="4" atomic-op="clear:XDMAC_GS">
          <bitfield caption="XDMAC Channel 0 Disable Bit" mask="0x00000001" name="DI0"/>
          <bitfield caption="XDMAC Channel 1 Disable Bit" mask="0x00000002" name="DI1"/>
          <bitfield caption="XDMAC Channel 2 Disable Bit" mask="0x00000004" name="DI2"/>
          <bitfield caption="XDMAC Channel 3 Disable Bit" mask="0x00000008" name="DI3"/>
          <bitfield caption="XDMAC Channel 4 Disable Bit" mask="0x00000010" name="DI4"/>
          <bitfield caption="XDMAC Channel 5 Disable Bit" mask="0x00000020" name="DI5"/>
          <bitfield caption="XDMAC Channel 6 Disable Bit" mask="0x00000040" name="DI6"/>
          <bitfield caption="XDMAC Channel 7 Disable Bit" mask="0x00000080" name="DI7"/>
          <bitfield caption="XDMAC Channel 8 Disable Bit" mask="0x00000100" name="DI8"/>
          <bitfield caption="XDMAC Channel 9 Disable Bit" mask="0x00000200" name="DI9"/>
          <bitfield caption="XDMAC Channel 10 Disable Bit" mask="0x00000400" name="DI10"/>
          <bitfield caption="XDMAC Channel 11 Disable Bit" mask="0x00000800" name="DI11"/>
          <bitfield caption="XDMAC Channel 12 Disable Bit" mask="0x00001000" name="DI12"/>
          <bitfield caption="XDMAC Channel 13 Disable Bit" mask="0x00002000" name="DI13"/>
          <bitfield caption="XDMAC Channel 14 Disable Bit" mask="0x00004000" name="DI14"/>
          <bitfield caption="XDMAC Channel 15 Disable Bit" mask="0x00008000" name="DI15"/>
          <bitfield caption="XDMAC Channel 16 Disable Bit" mask="0x00010000" name="DI16"/>
          <bitfield caption="XDMAC Channel 17 Disable Bit" mask="0x00020000" name="DI17"/>
          <bitfield caption="XDMAC Channel 18 Disable Bit" mask="0x00040000" name="DI18"/>
          <bitfield caption="XDMAC Channel 19 Disable Bit" mask="0x00080000" name="DI19"/>
          <bitfield caption="XDMAC Channel 20 Disable Bit" mask="0x00100000" name="DI20"/>
          <bitfield caption="XDMAC Channel 21 Disable Bit" mask="0x00200000" name="DI21"/>
          <bitfield caption="XDMAC Channel 22 Disable Bit" mask="0x00400000" name="DI22"/>
          <bitfield caption="XDMAC Channel 23 Disable Bit" mask="0x00800000" name="DI23"/>
        </register>
