Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70Q20.atdf
                <register offset="0x00000020" size="4" name="SHPR3" initval="0" caption="System Handler Priority Register 3">
                    <bitfield mask="0x000000ff" name="PRI_12" caption="Priority of system handler 12, SysTick"/>
                    <bitfield mask="0x00ff0000" name="PRI_14" caption="Priority of system handler 14, PendSV"/>
                    <bitfield mask="0xff000000" name="PRI_15" caption="Priority of system handler 15, SysTick exception"/>
                </register>
                <register offset="0x00000024" size="4" name="SHCSR" initval="0" caption="System Handler Control and State Register">
                    <bitfield mask="0x00000001" name="MEMFAULTACT" values="MEMFAULTACT"/>
                    <bitfield mask="0x00000002" name="BUSFAULTACT" values="BUSFAULTACT"/>
                    <bitfield mask="0x00000008" name="USGFAULTACT" values="USGFAULTACT"/>
                    <bitfield mask="0x00000080" name="SVCALLACT" values="SVCALLACT"/>
                    <bitfield mask="0x00000100" name="MONITORACT" values="MONITORACT"/>
                    <bitfield mask="0x00000400" name="PENDSVACT" values="PENDSVACT"/>
                    <bitfield mask="0x00000800" name="SYSTICKACT" values="SYSTICKACT"/>
                    <bitfield mask="0x00001000" name="USGFAULTPENDED" values="USGFAULTPENDED"/>
                    <bitfield mask="0x00002000" name="MEMFAULTPENDED" values="MEMFAULTPENDED"/>
                    <bitfield mask="0x00004000" name="BUSFAULTPENDED" values="BUSFAULTPENDED"/>
                    <bitfield mask="0x00008000" name="SVCALLPENDED" values="SVCALLPENDED"/>
                    <bitfield mask="0x00010000" name="MEMFAULTENA" values="MEMFAULTENA"/>
                    <bitfield mask="0x00020000" name="BUSFAULTENA" values="BUSFAULTENA"/>
                    <bitfield mask="0x00040000" name="USGFAULTENA" values="USGFAULTENA"/>
                </register>
                <register offset="0x00000028" size="4" name="CFSR" initval="0" caption="Configurable Fault Status Registers">
                    <bitfield mask="0x00000001" name="IACCVIOL" values="IACCVIOL"/>
                    <bitfield mask="0x00000002" name="DACCVIOL" values="DACCVIOL"/>
                    <bitfield mask="0x00000008" name="MUNSTKERR" values="MUNSTKERR"/>
                    <bitfield mask="0x00000010" name="MSTKERR" values="MSTKERR"/>
                    <bitfield mask="0x00000020" name="MLSPERR" values="MLSPERR"/>
                    <bitfield mask="0x00000080" name="MMARVALID" values="MMARVALID"/>
                    <bitfield mask="0x00000100" name="IBUSERR" values="IBUSERR"/>
                    <bitfield mask="0x00000200" name="PRECISERR" values="PRECISERR"/>
                    <bitfield mask="0x00000400" name="IMPRECISERR" values="IMPRECISERR"/>
                    <bitfield mask="0x00000800" name="UNSTKERR" values="UNSTKERR"/>
                    <bitfield mask="0x00001000" name="STKERR" values="STKERR"/>
                    <bitfield mask="0x00002000" name="LSPERR" values="LSPERR"/>
                    <bitfield mask="0x00008000" name="BFARVALID" values="BFARVALID"/>
                    <bitfield mask="0x00010000" name="UNDEFINSTR" values="UNDEFINSTR"/>
                    <bitfield mask="0x00020000" name="INVSTATE" values="INVSTATE"/>
                    <bitfield mask="0x00040000" name="INVPC" values="INVPC"/>
                    <bitfield mask="0x00080000" name="NOCP" values="NOCP"/>
                    <bitfield mask="0x01000000" name="UNALIGNED" values="UNALIGNED"/>
                    <bitfield mask="0x02000000" name="DIVBYZERO" values="DIVBYZERO"/>
                </register>
                <register offset="0x0000002c" size="4" name="HFSR" initval="0" caption="HardFault Status register">
                    <bitfield mask="0x00000002" name="VECTTBL" values="VECTTBL" caption="Indicates when a fault has occurred because of a vector table read error on exception processing"/>
                    <bitfield mask="0x40000000" name="FORCED" values="FORCED" caption="Indicates that a fault with configurable priority has been escalated to a HardFault exception"/>
                    <bitfield mask="0x80000000" name="DEBUGEVT" caption="Indicates when a Debug event has occurred"/>
                </register>
                <register offset="0x00000030" size="4" name="DFSR" initval="0" caption="Debug Fault Status Register">
                    <bitfield mask="0x00000001" name="HALTED" values="HALTED" caption="debug event generated by"/>
                    <bitfield mask="0x00000002" name="BKPT" values="BKPT" caption="debug event generated by BKPT instruction execution or a breakpoint match in FPB"/>
                    <bitfield mask="0x00000004" name="DWTTRAP" values="DWTTRAP" caption="debug event generated by the DWT"/>
                    <bitfield mask="0x00000008" name="VCATCH" values="VCATCH" caption="triggering of a Vector catch"/>
                    <bitfield mask="0x00000010" name="EXTERNAL" values="EXTERNAL" caption="debug event generated because of the assertion of an external debug request"/>
                </register>
                <register offset="0x00000034" size="4" name="MMFAR" initval="0" caption="MemManage Fault Address Register">
                    <bitfield mask="0xffffffff" name="ADDRESS" caption="Data address for an MPU fault"/>
                </register>
                <register offset="0x00000038" size="4" name="BFAR" initval="0" caption="BusFault Address Register">
                    <bitfield mask="0xffffffff" name="ADDRESS" caption="Data address for a precise bus fault"/>
                </register>
                <register offset="0x0000003C" size="4" name="AFSR" initval="0" caption="Auxiliary Fault Status Register">
                </register>
                <register offset="0x00000078" size="4" name="CLIDR" initval="0x09000003" rw="R" caption="Cache Level ID Register">
                    <bitfield mask="0x07000000" name="LoC" values="LOCLOU" caption="Level of Coherency"/>
                    <bitfield mask="0x38000000" name="LoU" values="LOCLOU" caption="Level of Unification"/>
                </register>
