Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70Q20.atdf
            <value-group name="MUNSTKERR">
                <value value="0" name="VALUE_0" caption="no unstacking fault"/>
                <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more access violations"/>
            </value-group>
            <value-group name="MSTKERR">
                <value value="0" name="VALUE_0" caption="no stacking fault"/>
                <value value="1" name="VALUE_1" caption="stacking for an exception entry has caused one or more access violations"/>
            </value-group>
            <value-group name="MLSPERR">
                <value value="0" name="VALUE_0" caption="No MemManage fault occurred during floating-point lazy state preservation"/>
                <value value="1" name="VALUE_1" caption="A MemManage fault occurred during floating-point lazy state preservation"/>
            </value-group>
            <value-group name="MMARVALID">
                <value value="0" name="VALUE_0" caption="value in MMAR is not a valid fault address"/>
                <value value="1" name="VALUE_1" caption="MMAR holds a valid fault address"/>
            </value-group>
            <value-group name="IBUSERR">
                <value value="0" name="VALUE_0" caption="no instruction bus error"/>
                <value value="1" name="VALUE_1" caption="instruction bus error"/>
            </value-group>
            <value-group name="PRECISERR">
                <value value="0" name="VALUE_0" caption="no precise data bus error"/>
                <value value="1" name="VALUE_1" caption="a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault"/>
            </value-group>
            <value-group name="IMPRECISERR">
                <value value="0" name="VALUE_0" caption="no imprecise data bus error"/>
                <value value="1" name="VALUE_1" caption="a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error"/>
            </value-group>
            <value-group name="UNSTKERR">
                <value value="0" name="VALUE_0" caption="no unstacking fault"/>
                <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more BusFaults"/>
            </value-group>
            <value-group name="STKERR">
                <value value="0" name="VALUE_0" caption="no stacking fault"/>
                <value value="1" name="VALUE_1" caption="stacking for an exception entry has caused one or more BusFaults"/>
            </value-group>
            <value-group name="LSPERR">
                <value value="0" name="VALUE_0" caption="No bus fault occurred during floating-point lazy state preservation"/>
                <value value="1" name="VALUE_1" caption="A bus fault occurred during floating-point lazy state preservation"/>
            </value-group>
            <value-group name="BFARVALID">
                <value value="0" name="VALUE_0" caption="value in BFAR is not a valid fault address"/>
                <value value="1" name="VALUE_1" caption="BFAR holds a valid fault address"/>
            </value-group>
            <value-group name="UNDEFINSTR">
                <value value="0" name="VALUE_0" caption="no undefined instruction UsageFault"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted to execute an undefined instruction"/>
            </value-group>
            <value-group name="INVSTATE">
                <value value="0" name="VALUE_0" caption="no invalid state UsageFault"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted to execute an instruction that makes illegal use of the EPSR"/>
            </value-group>
            <value-group name="INVPC">
                <value value="0" name="VALUE_0" caption="no invalid PC load UsageFault"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted an illegal load of EXC_RETURN to the PC"/>
            </value-group>
            <value-group name="NOCP">
                <value value="0" name="VALUE_0" caption="no UsageFault caused by attempting to access a coprocessor"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted to access a coprocessor"/>
            </value-group>
            <value-group name="UNALIGNED">
                <value value="0" name="VALUE_0" caption="no unaligned access fault, or unaligned access trapping not enabled"/>
                <value value="1" name="VALUE_1" caption="the processor has made an unaligned memory access"/>
            </value-group>
            <value-group name="DIVBYZERO">
                <value value="0" name="VALUE_0" caption="no divide by zero fault, or divide by zero trapping not enabled"/>
                <value value="1" name="VALUE_1" caption="the processor has executed an SDIV or UDIV instruction with a divisor of 0"/>
            </value-group>
            <value-group name="VECTTBL">
                <value value="0" name="VALUE_0" caption="no BusFault on vector table read"/>
                <value value="1" name="VALUE_1" caption="BusFault on vector table read"/>
            </value-group>
            <value-group name="FORCED">
                <value value="0" name="VALUE_0" caption="no forced HardFault"/>
                <value value="1" name="VALUE_1" caption="forced HardFault"/>
            </value-group>
            <value-group name="HALTED">
                <value value="0" name="VALUE_0" caption="No active halt request debug event"/>
                <value value="1" name="VALUE_1" caption="Halt request debug event active"/>
            </value-group>
            <value-group name="BKPT">
                <value value="0" name="VALUE_0" caption="No current breakpoint debug event"/>
                <value value="1" name="VALUE_1" caption="At least one current breakpoint debug event"/>
            </value-group>
            <value-group name="DWTTRAP">
                <value value="0" name="VALUE_0" caption="No current debug events generated by the DWT"/>
                <value value="1" name="VALUE_1" caption="At least one current debug event generated by the DWT"/>
            </value-group>
