Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70Q20.atdf
                <register offset="0x00000014" size="4" name="MVFR1" initval="0x11000011" rw="R" caption="Media and VFP Feature Register 1">
                    <bitfield mask="0x0000000F" name="FtZ_mode" caption="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
                    <bitfield mask="0x000000F0" name="D_NaN_mode" caption="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
                    <bitfield mask="0x0F000000" name="FP_HPFP" caption="Floating Point Half-Precision and double-precision"/>
                    <bitfield mask="0xF0000000" name="FP_fused_MAC" caption="Indicates whether the FP supports fused multiply accumulate operations"/>
                </register>
                <register offset="0x00000018" size="4" name="MVFR2" initval="0x00000040" rw="R" caption="Media and VFP Feature Register 2">
                    <bitfield mask="0x000000F0" name="VFP_Misc" caption="Indicates the hardware support for FP miscellaneous features"/>
                </register>
                
            </register-group>
        </module>
    <module name="EBI" id="A" version="A"/>
  </modules>
  <pinouts>
    <pinout name="TFBGA_LFBGA_144">
      <pin position="A1" pad="PE1"/>
      <pin position="A2" pad="PB9"/>
      <pin position="A3" pad="PB8"/>
      <pin position="A4" pad="HSDP"/>
      <pin position="A5" pad="PD2"/>
      <pin position="A6" pad="PA29"/>
      <pin position="A7" pad="PC21"/>
      <pin position="A8" pad="PD6"/>
      <pin position="A9" pad="PC20"/>
      <pin position="A10" pad="PA30"/>
      <pin position="A11" pad="PD15"/>
      <pin position="A12" pad="PB4"/>
      <pin position="B1" pad="PE2"/>
      <pin position="B2" pad="PB13"/>
      <pin position="B3" pad="VDDUTMIC"/>
      <pin position="B4" pad="HSDM"/>
      <pin position="B5" pad="PD1"/>
      <pin position="B6" pad="PC24"/>
      <pin position="B7" pad="PD3"/>
      <pin position="B8" pad="PD7"/>
      <pin position="B9" pad="PA6"/>
      <pin position="B10" pad="PC18"/>
      <pin position="B11" pad="JTAGSEL"/>
      <pin position="B12" pad="PC17"/>
      <pin position="C1" pad="VDDIN"/>
      <pin position="C2" pad="PE0"/>
      <pin position="C3" pad="VDDOUT"/>
      <pin position="C4" pad="VBG"/>
      <pin position="C5" pad="PC25"/>
      <pin position="C6" pad="PC23"/>
      <pin position="C7" pad="PC22"/>
      <pin position="C8" pad="PA31"/>
      <pin position="C9" pad="PA28"/>
      <pin position="C10" pad="PB5"/>
      <pin position="C11" pad="PA0"/>
      <pin position="C12" pad="PD10"/>
      <pin position="D1" pad="ADVREFP"/>
      <pin position="D2" pad="ADVREFN"/>
      <pin position="D3" pad="PD31"/>
      <pin position="D4" pad="PD0"/>
      <pin position="D5" pad="GNDANA"/>
      <pin position="D6" pad="PD4"/>
      <pin position="D7" pad="PD5"/>
      <pin position="D8" pad="PC19"/>
      <pin position="D9" pad="PD9"/>
      <pin position="D10" pad="PD29"/>
      <pin position="D11" pad="PC16"/>
      <pin position="D12" pad="PA1"/>
      <pin position="E1" pad="PC31"/>
      <pin position="E2" pad="PC27"/>
      <pin position="E3" pad="PE3"/>
      <pin position="E4" pad="PC0"/>
      <pin position="E5" pad="GNDUTMI"/>
      <pin position="E6" pad="GNDPLLUSB"/>
      <pin position="E7" pad="VDDUTMII"/>
      <pin position="E8" pad="VDDCORE"/>
      <pin position="E9" pad="PD8"/>
      <pin position="E10" pad="PC14"/>
      <pin position="E11" pad="PD11"/>
      <pin position="E12" pad="PA2"/>
      <pin position="F1" pad="PC30"/>
      <pin position="F2" pad="PC26"/>
      <pin position="F3" pad="PC29"/>
      <pin position="F4" pad="PC12"/>
      <pin position="F5" pad="GND"/>
      <pin position="F6" pad="GND"/>
      <pin position="F7" pad="GNDPLL"/>
      <pin position="F8" pad="VDDPLLUSB"/>
      <pin position="F9" pad="PB7"/>
      <pin position="F10" pad="PC10"/>
      <pin position="F11" pad="PC11"/>
      <pin position="F12" pad="PA3"/>
      <pin position="G1" pad="PC15"/>
      <pin position="G2" pad="PC13"/>
      <pin position="G3" pad="PB1"/>
      <pin position="G4" pad="GND"/>
      <pin position="G5" pad="GND"/>
      <pin position="G6" pad="GND"/>
      <pin position="G7" pad="GND"/>
      <pin position="G8" pad="VDDIO"/>
      <pin position="G9" pad="PD13"/>
      <pin position="G10" pad="PD12"/>
      <pin position="G11" pad="PC9"/>
      <pin position="G12" pad="PB12"/>
      <pin position="H1" pad="PA19"/>
      <pin position="H2" pad="PA18"/>
      <pin position="H3" pad="PA20"/>
      <pin position="H4" pad="PB0"/>
      <pin position="H5" pad="VDDCORE"/>
      <pin position="H6" pad="VDDIO"/>
      <pin position="H7" pad="VDDIO"/>
      <pin position="H8" pad="VDDCORE"/>
      <pin position="H9" pad="PD21"/>
      <pin position="H10" pad="PD14"/>
      <pin position="H11" pad="TST"/>
      <pin position="H12" pad="NRST"/>
      <pin position="J1" pad="PA17"/>
      <pin position="J2" pad="PB2"/>
      <pin position="J3" pad="PB3"/>
      <pin position="J4" pad="PC1"/>
      <pin position="J5" pad="PC4"/>
      <pin position="J6" pad="PD27"/>
      <pin position="J7" pad="VDDPLL"/>
      <pin position="J8" pad="PA26"/>
      <pin position="J9" pad="PA11"/>
      <pin position="J10" pad="PA27"/>
      <pin position="J11" pad="PB6"/>
      <pin position="J12" pad="PC8"/>
      <pin position="K1" pad="PE4"/>
      <pin position="K2" pad="PA21"/>
      <pin position="K3" pad="PA22"/>
      <pin position="K4" pad="PC2"/>
      <pin position="K5" pad="PA16"/>
      <pin position="K6" pad="PA14"/>
      <pin position="K7" pad="PC6"/>
      <pin position="K8" pad="PA25"/>
      <pin position="K9" pad="PD20"/>
      <pin position="K10" pad="PD28"/>
      <pin position="K11" pad="PD16"/>
      <pin position="K12" pad="PA4"/>
      <pin position="L1" pad="PE5"/>
      <pin position="L2" pad="PA7"/>
      <pin position="L3" pad="PC3"/>
      <pin position="L4" pad="PA23"/>
      <pin position="L5" pad="PA15"/>
      <pin position="L6" pad="PD26"/>
      <pin position="L7" pad="PA24"/>
      <pin position="L8" pad="PC5"/>
      <pin position="L9" pad="PA10"/>
      <pin position="L10" pad="PA12"/>
      <pin position="L11" pad="PD17"/>
      <pin position="L12" pad="PC28"/>
      <pin position="M1" pad="PD30"/>
      <pin position="M2" pad="PA8"/>
      <pin position="M3" pad="PA13"/>
      <pin position="M4" pad="PC7"/>
      <pin position="M5" pad="PD25"/>
      <pin position="M6" pad="PD24"/>
      <pin position="M7" pad="PD23"/>
      <pin position="M8" pad="PD22"/>
      <pin position="M9" pad="PD19"/>
      <pin position="M10" pad="PD18"/>
      <pin position="M11" pad="PA5"/>
      <pin position="M12" pad="PA9"/>
    </pinout>
    <pinout name="LQFP144">
      <pin position="102" pad="PA0"/>
      <pin position="99" pad="PA1"/>
      <pin position="93" pad="PA2"/>
      <pin position="91" pad="PA3"/>
      <pin position="77" pad="PA4"/>
      <pin position="73" pad="PA5"/>
      <pin position="114" pad="PA6"/>
      <pin position="35" pad="PA7"/>
      <pin position="36" pad="PA8"/>
      <pin position="75" pad="PA9"/>
      <pin position="66" pad="PA10"/>
      <pin position="64" pad="PA11"/>
      <pin position="68" pad="PA12"/>
      <pin position="42" pad="PA13"/>
      <pin position="51" pad="PA14"/>
      <pin position="49" pad="PA15"/>
      <pin position="45" pad="PA16"/>
      <pin position="25" pad="PA17"/>
      <pin position="24" pad="PA18"/>
      <pin position="23" pad="PA19"/>
      <pin position="22" pad="PA20"/>
      <pin position="32" pad="PA21"/>
      <pin position="37" pad="PA22"/>
      <pin position="46" pad="PA23"/>
      <pin position="56" pad="PA24"/>
      <pin position="59" pad="PA25"/>
      <pin position="62" pad="PA26"/>
      <pin position="70" pad="PA27"/>
      <pin position="112" pad="PA28"/>
      <pin position="129" pad="PA29"/>
      <pin position="116" pad="PA30"/>
      <pin position="118" pad="PA31"/>
      <pin position="21" pad="PB0"/>
      <pin position="20" pad="PB1"/>
      <pin position="26" pad="PB2"/>
      <pin position="31" pad="PB3"/>
      <pin position="105" pad="PB4"/>
      <pin position="109" pad="PB5"/>
      <pin position="79" pad="PB6"/>
      <pin position="89" pad="PB7"/>
      <pin position="141" pad="PB8"/>
      <pin position="142" pad="PB9"/>
      <pin position="87" pad="PB12"/>
      <pin position="144" pad="PB13"/>
      <pin position="11" pad="PC0"/>
      <pin position="38" pad="PC1"/>
      <pin position="39" pad="PC2"/>
      <pin position="40" pad="PC3"/>
      <pin position="41" pad="PC4"/>
      <pin position="58" pad="PC5"/>
      <pin position="54" pad="PC6"/>
      <pin position="48" pad="PC7"/>
      <pin position="82" pad="PC8"/>
      <pin position="86" pad="PC9"/>
      <pin position="90" pad="PC10"/>
      <pin position="94" pad="PC11"/>
      <pin position="17" pad="PC12"/>
      <pin position="19" pad="PC13"/>
      <pin position="97" pad="PC14"/>
      <pin position="18" pad="PC15"/>
      <pin position="100" pad="PC16"/>
      <pin position="103" pad="PC17"/>
      <pin position="111" pad="PC18"/>
      <pin position="117" pad="PC19"/>
      <pin position="120" pad="PC20"/>
      <pin position="122" pad="PC21"/>
      <pin position="124" pad="PC22"/>
      <pin position="127" pad="PC23"/>
      <pin position="130" pad="PC24"/>
      <pin position="133" pad="PC25"/>
      <pin position="13" pad="PC26"/>
      <pin position="12" pad="PC27"/>
      <pin position="76" pad="PC28"/>
      <pin position="16" pad="PC29"/>
      <pin position="15" pad="PC30"/>
      <pin position="14" pad="PC31"/>
      <pin position="1" pad="PD0"/>
      <pin position="132" pad="PD1"/>
      <pin position="131" pad="PD2"/>
      <pin position="128" pad="PD3"/>
      <pin position="126" pad="PD4"/>
      <pin position="125" pad="PD5"/>
      <pin position="121" pad="PD6"/>
      <pin position="119" pad="PD7"/>
      <pin position="113" pad="PD8"/>
      <pin position="110" pad="PD9"/>
      <pin position="101" pad="PD10"/>
      <pin position="98" pad="PD11"/>
      <pin position="92" pad="PD12"/>
      <pin position="88" pad="PD13"/>
      <pin position="84" pad="PD14"/>
      <pin position="106" pad="PD15"/>
      <pin position="78" pad="PD16"/>
      <pin position="74" pad="PD17"/>
      <pin position="69" pad="PD18"/>
      <pin position="67" pad="PD19"/>
      <pin position="65" pad="PD20"/>
      <pin position="63" pad="PD21"/>
      <pin position="60" pad="PD22"/>
      <pin position="57" pad="PD23"/>
      <pin position="55" pad="PD24"/>
      <pin position="52" pad="PD25"/>
      <pin position="53" pad="PD26"/>
      <pin position="47" pad="PD27"/>
      <pin position="71" pad="PD28"/>
      <pin position="108" pad="PD29"/>
      <pin position="34" pad="PD30"/>
      <pin position="2" pad="PD31"/>
      <pin position="4" pad="PE0"/>
      <pin position="6" pad="PE1"/>
      <pin position="7" pad="PE2"/>
      <pin position="10" pad="PE3"/>
      <pin position="27" pad="PE4"/>
      <pin position="28" pad="PE5"/>
      <pin position="3" pad="VDDOUT"/>
      <pin position="5" pad="VDDIN"/>
      <pin position="8" pad="VREFN"/>
      <pin position="9" pad="VREFP"/>
      <pin position="83" pad="NRST"/>
      <pin position="85" pad="TST"/>
      <pin position="30" pad="VDDIO"/>
      <pin position="43" pad="VDDIO"/>
      <pin position="72" pad="VDDIO"/>
      <pin position="80" pad="VDDIO"/>
      <pin position="96" pad="VDDIO"/>
      <pin position="104" pad="JTAGSEL"/>
      <pin position="29" pad="VDDCORE"/>
      <pin position="33" pad="VDDCORE"/>
      <pin position="50" pad="VDDCORE"/>
      <pin position="81" pad="VDDCORE"/>
      <pin position="107" pad="VDDCORE"/>
      <pin position="123" pad="VDDPLL"/>
      <pin position="134" pad="VDDUTMII"/>
      <pin position="136" pad="HSDM"/>
      <pin position="137" pad="HSDP"/>
      <pin position="44" pad="GND"/>
      <pin position="61" pad="GND"/>
      <pin position="95" pad="GND"/>
      <pin position="115" pad="GND"/>
      <pin position="135" pad="GND"/>
      <pin position="138" pad="GND"/>
      <pin position="139" pad="VDDUTMIC"/>
      <pin position="140" pad="VBG"/>
      <pin position="143" pad="VDDPLLUSB"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>